نویسنده : [ Reza ]
تاریخ : [ 2025 / 10 / 17 ]
# توضیح کلی:
# این برنامه بر اساس طول خواسته‌شده یک رمز عبور تولید می‌کند.
# الگوی انتخاب کاراکترها با استفاده از باقیمانده تقسیم اندیس i روی اعداد 4، 3، 2 تعیین می‌شود.

# مجموعه حروف بزرگ انگلیسی
upper_letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"

# مجموعه حروف کوچک انگلیسی
letters = "abcdefghijklmnopqrstuvwxyz"

# ارقام (اعداد)
digits = "0123456789"

# نمادهای مجاز در رمز
symbols = "#!@$%&*"

# دریافت طول رمز از کاربر (رشته -> عدد صحیح)
length = int(input("طول رمز عبور مورد نظر شما چقدر است؟"))

# متغیر نگهدارنده رمز تولیدشده (ابتدایی خالی)
password = ""

# شروع حلقه برای تولید رمز عبور با طول دلخواه کاربر
for i in range(length) :

# شرط بررسی برای انتخاب کاراکتر از حروف بزرگ: اگر اندیس بر 4 بخش‌پذیر باشد
if i % 4 == 0 :
  
    # انتخاب کاراکتر از رشته حروف بزرگ با استفاده از باقی‌مانده تقسیم بر طول رشته
    char_to_add = upper_letters[ i % len(upper_letters)]

# شرط بررسی برای انتخاب کاراکتر از نمادها: اگر اندیس بر 3 بخش‌پذیر باشد
elif i % 3 == 0 :
  
    # انتخاب کاراکتر از رشته نمادها با استفاده از باقی‌مانده تقسیم بر طول رشته
    char_to_add = symbols[ i % len(symbols) ]
    
# شرط بررسی برای انتخاب کاراکتر از حروف کوچک: اگر اندیس بر 2 بخش‌پذیر باشد
elif i % 2 == 0 :
  
    # انتخاب کاراکتر از رشته حروف کوچک با استفاده از باقی‌مانده تقسیم بر طول رشته
    char_to_add = letters[ i % len(letters) ]
    
# شرط پیش‌فرض برای انتخاب کاراکتر از اعداد: در صورتی که هیچ شرط قبلی برقرار نباشد
else :
    
    # انتخاب کاراکتر از رشته اعداد با استفاده از باقی‌مانده تقسیم بر طول رشته
    char_to_add = digits[ i % len(digits) ]
  

# اضافه کردن کاراکتر انتخاب شده به رشته پسورد
password += char_to_add
